In [43]:
# import sqlite library
import sqlite3
import pandas as pd

In [18]:
# create a database connection in a memory
conn = sqlite3.connect(':memory:')

In [19]:
# connect to a database
conn = sqlite3.connect('customer.db') # if database not exist, sqlite will create a new database

In [20]:
# create a cursor for the connection
c = conn.cursor()

DATATYPE is a type of data, you need to define the type of data in each table field.
In sqlite, there are some built-in datatypes.
- NULL
- INTERGER
- REAL
- TEXT
- BLOB
- CHAR

In [15]:
# create a table, same syntax with sql
# NOTE: sqlite3 is case sensitive
c.execute("""CREATE TABLE customers (
    first_name TEXT,
    last_name TEXT,
    email TEXT
)""")

In [72]:
c.execute("""
CREATE TABLE IF NOT EXISTS customer (
    first_name CHAR(20) PRIMARY KEY, 
    last_name CHAR(20) NOT NULL,
    email CHAR(25) NOT NULL)
""")

In [73]:
# drop a table
c.execute("""DROP TABLE customer""")

In [21]:
# insert a single record
c.execute("""INSERT INTO customers 
             VALUES ('John', 'Elder', 'john@codemy.com')
""")

In [23]:
# insert multiple records
customers = [('Wes', 'Brown', 'wes@brown.com'), 
             ('Steph', 'Kuewa', 'steph@kuewa.com'),
             ('Dan', 'Pas', 'dan@pas.com')]

c.executemany("""INSERT INTO customers
VALUES (?, ?, ?)
""", customers)

In [33]:
# query the database
c.execute("""
SELECT * 
FROM customers
""")

# lookup one result
one_result = c.fetchone()
print(one_result)

('John', 'Elder', 'john@codemy.com')

In [38]:
# query the database
c.execute("""
SELECT * 
FROM customers
""")

# lookup many result
many_result = c.fetchmany(3)
print(many_result)

[('John', 'Elder', 'john@codemy.com'), ('Wes', 'Brown', 'wes@brown.com'), ('Steph', 'Kuewa', 'steph@kuewa.com')]

In [45]:
# query the database
c.execute("""
SELECT * 
FROM customers
""")

# lookup all result
items = c.fetchall()
pd.DataFrame(items, columns=['first_name', 'last_name', 'email'])

  first_name last_name            email
0       John     Elder  john@codemy.com
1        Wes     Brown    wes@brown.com
2      Steph     Kuewa  steph@kuewa.com
3        Dan       Pas      dan@pas.com

In [47]:
# query the database
c.execute("""
SELECT rowid, * 
FROM customers
""")

# lookup all result
items = c.fetchall()
pd.DataFrame(items, columns=['row_id', 'first_name', 'last_name', 'email'])

   row_id first_name last_name            email
0       1       John     Elder  john@codemy.com
1       2        Wes     Brown    wes@brown.com
2       3      Steph     Kuewa  steph@kuewa.com
3       4        Dan       Pas      dan@pas.com

In [48]:
# query the database
c.execute("""
SELECT * 
FROM customers
WHERE last_name = 'Elder'
""")

# lookup all result
items = c.fetchall()
pd.DataFrame(items, columns=['first_name', 'last_name', 'email'])

  first_name last_name            email
0       John     Elder  john@codemy.com

In [49]:
# query the database
c.execute("""
SELECT * 
FROM customers
WHERE last_name LIKE 'Br%'
""")

# lookup all result
items = c.fetchall()
pd.DataFrame(items, columns=['first_name', 'last_name', 'email'])

  first_name last_name          email
0        Wes     Brown  wes@brown.com

In [53]:
# query the database
c.execute("""
SELECT * 
FROM customers
WHERE email LIKE '%codemy.com'
""")

# lookup all result
items = c.fetchall()
pd.DataFrame(items, columns=['first_name', 'last_name', 'email'])

  first_name last_name            email
0       John     Elder  john@codemy.com

In [55]:
# update some records
c.execute("""
UPDATE customers 
SET first_name = 'Bob'
WHERE last_name = 'Elder'
""")

In [59]:
c.execute("""
SELECT rowid, * 
FROM customers
""")

# lookup all result
c.fetchall()

[(1, 'Bob', 'Elder', 'john@codemy.com'),
 (2, 'Wes', 'Brown', 'wes@brown.com'),
 (3, 'Steph', 'Kuewa', 'steph@kuewa.com'),
 (4, 'Dan', 'Pas', 'dan@pas.com')]

In [60]:
# delete a record
c.execute("""
DELETE from customers 
WHERE rowid = 4
""")

c.execute("""
SELECT rowid, *
FROM customers
""").fetchall()

[(1, 'Bob', 'Elder', 'john@codemy.com'),
 (2, 'Wes', 'Brown', 'wes@brown.com'),
 (3, 'Steph', 'Kuewa', 'steph@kuewa.com')]

In [62]:
# order the fetch result
pd.read_sql_query("""
SELECT * FROM customers c ORDER BY c.last_name\
""", conn)

  first_name last_name            email
0        Wes     Brown    wes@brown.com
1        Bob     Elder  john@codemy.com
2      Steph     Kuewa  steph@kuewa.com

In [64]:
# order the fetch result with descending order
pd.read_sql_query("""
SELECT * FROM customers c ORDER BY c.last_name DESC
""", conn)

  first_name last_name            email
0      Steph     Kuewa  steph@kuewa.com
1        Bob     Elder  john@codemy.com
2        Wes     Brown    wes@brown.com

In [65]:
# order the fetch result with descending order
pd.read_sql_query("""
SELECT * FROM customers c ORDER BY c.last_name DESC LIMIT 1
""", conn)

  first_name last_name            email
0      Steph     Kuewa  steph@kuewa.com

In [67]:
# select with multiple conditions
pd.read_sql_query("""
SELECT * 
FROM customers c 
WHERE last_name LIKE 'Br%' OR rowid = 3
""", conn)

  first_name last_name            email
0        Wes     Brown    wes@brown.com
1      Steph     Kuewa  steph@kuewa.com

Remember always commit your execution and close your database connection after all operations.

In [46]:
# commit the command
conn.commit()

In [17]:
# close the connection
conn.close()